src/Catalogs/ПоказателиСкоростиВыполненияТипичныхОпераций/ПоказателиСкоростиВыполненияТипичныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиСкоростиВыполненияТипичныхОпераций</name>
  <owners>Catalog.ПоказателиМониторинга</owners>
  <owners>Catalog.ПоказателиОповещений</owners>
  <owners>Catalog.ПоказателиИнцидентов</owners>
  <attributes>
    <name>АвтоМасштаб</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВременноеСмещение</name>
    <type>
      <types>EnumRef.ВариантыСмещенияВременногоОкна</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлючевойОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменилосьСглаживание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменился</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменилсяВид</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТипаПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьДанныеЗаПрошлыйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТренд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСглаживания</name>
    <type>
      <types>EnumRef.ТипыСглаживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСпискаПользователей</name>
    <type>
      <types>EnumRef.ТипыСпискаПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторКлючевойОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КлючевыеОперации</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнформационныеБазы</name>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПользователиСсылка</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ПользователиЗамерПроизводительности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ОценкаПроизводительностиКлючевыеОперации/ОценкаПроизводительностиКлючевыеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкаПроизводительностиКлючевыеОперации</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦелевоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальноДопустимыйУровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПриоритетВИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦелевоеВремяВИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВыполненаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПомеченаНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ПоказателиСкоростиВыполненияТипичныхОпераций/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура КлючевыеОперацииНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    ИнформационныеБазыМассив = Новый Массив;
    Для Каждого ТекИнформационнаяБаза Из Объект.ИнформационныеБазы Цикл
        ИнформационныеБазыМассив.Добавить(ТекИнформационнаяБаза.ИнформационнаяБаза);
    КонецЦикла;
        
    ПараметрыОткрытия = Новый Структура("ИнформационныеБазы", ИнформационныеБазыМассив);
    ПараметрыОткрытия.Вставить("РежимВыделения", "Одиночный");
    ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("КлючевыеОперацииНаименованиеОповещениеОЗакрытии", ЭтотОбъект);
    ОткрытьФорму("РегистрСведений.ОценкаПроизводительностиКлючевыеОперации.Форма.ФормаВыбораИменКлючевыхОперацийИнформационныхБаз", ПараметрыОткрытия,,,,,ОписаниеОповещенияОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеОперацииНаименованиеОповещениеОЗакрытии(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
    
    Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда
        
        Если РезультатЗакрытия.Количество() = 1 Тогда
            Элементы.КлючевыеОперации.ТекущиеДанные.Наименование = РезультатЗакрытия[0];
        ИначеЕсли РезультатЗакрытия.Количество() > 1 Тогда
            Для Каждого ТекКлючеваяОперация Из РезультатЗакрытия Цикл
                НовКлючеваяОперация = Объект.КлючевыеОперации.Добавить();
                НовКлючеваяОперация.Наименование = ТекКлючеваяОперация;
            КонецЦикла;
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеОперацииДобавитьНесколько(Команда)
    
    ИнформационныеБазыМассив = Новый Массив;
    Для Каждого ТекИнформационнаяБаза Из Объект.ИнформационныеБазы Цикл
        ИнформационныеБазыМассив.Добавить(ТекИнформационнаяБаза.ИнформационнаяБаза);
    КонецЦикла;
        
    ПараметрыОткрытия = Новый Структура("ИнформационныеБазы", ИнформационныеБазыМассив);
    ПараметрыОткрытия.Вставить("РежимВыделения", "Множественный");
    ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("КлючевыеОперацииНаименованиеОповещениеОЗакрытии", ЭтотОбъект);
    ОткрытьФорму("РегистрСведений.ОценкаПроизводительностиКлючевыеОперации.Форма.ФормаВыбораИменКлючевыхОперацийИнформационныхБаз", ПараметрыОткрытия,,,,,ОписаниеОповещенияОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрОповещения = МониторингСервер.ПараметрОповещенияПоказательЗаписан(ТекущийОбъект);
	ПараметрОповещения.Изменился = ОбъектИзменился();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрОповещения.Ссылка = Объект.Ссылка;
	ПараметрОповещения.Описание = Объект.Описание;
	Оповестить("ПоказательЗаписан", ПараметрОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ОбъектИзменился()
	
	Если Объект.ИнформационнаяБаза <> Объект.Ссылка.ИнформационнаяБаза Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Объект.ИдентификаторКлючевойОперации <> Объект.Ссылка.ИдентификаторКлючевойОперации Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Объект.ТипСпискаПользователей <> Объект.Ссылка.ТипСпискаПользователей Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПользователиСсылка = Объект.Ссылка.Пользователи;
	ВыбранныеПользователи = Объект.Пользователи;
	
	Если ВыбранныеПользователи.Количество() <> ПользователиСсылка.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого СтрокаПользователя Из ВыбранныеПользователи Цикл
		
		Если ПользователиСсылка.Найти(СтрокаПользователя.ИмяПользователя) = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
